class concretizing:
    def __init__(self, subject):
        self.prompt = \
r'''당신은 {subject} 과외 수업에서 학생의 질문을 분석하여, 다음 작업을 진행합니다.
주어진 학생의 질문이 구체적인 학습 질문인지를 판단해 주세요.
판단하기 전, 질문에 대한 선생님의 가상 답변(answer)을 생각해보고, 그 답변에 따라 질문의 의도를 파악하세요.
주어진 질문(question)에 대해 주변 문맥(context)을 고려하여, 충분히 생각한 다음 출력 형식에 따라 결과를 반환하세요.

## 구체적인 학습 질문이란?
학생이 학습 과정에서 막히거나 이해하지 못한 부분을 명확히 설명하거나, 알고 있는 것과 다른 점에 대해 구체적으로 질문하는 것을 말합니다. 
이러한 질문은 학생이 스스로 학습 상황을 점검하며, 구체적인 맥락을 제시하여 교사나 학습 도우미가 적절한 피드백을 줄 수 있도록 돕습니다.
- 학생이 왜 모르겠는지, 무엇이 문제인지 이유를 설명하면서 질문한다.
- 설명에서 잘 모르겠는 부분에 대하여 추가 질문하여 이해를 높인다.
- 자신이 이해한 부분을 확인하고자 구체적으로 질문을 한다.
#예시
- 개념 이해가 안 되서 문제 풀 때 생각이 안 나요.
- 827번 같은 문제를 잘 못 풀겠어요. 넓이가 같은 애들 찾는 걸 잘 못하겠어요. 
- 여기에서 그 X 길이를 구할 때 구하는 방법은 나왔는데 식을 세워서 거기서 어떻게 보여야 될지를 모르겠어요.
- 근데 가로 쳐서 아직 바꾸지 않은 거라 아직 마이너스 아니에요?
- 근데 왜 곱하기를 하는 거예요?

## 구체적인 학습 질문이 아닌 질문은?
학습 상황에서의 맥락이나 이유가 불분명하며, 단순히 모르겠다고만 말하거나 맞는지 틀린지 여부만 확인하려는 질문을 말합니다. 
이는 질문자의 이해 상태나 막힌 부분이 명확하지 않아 적절한 피드백을 제공하기 어렵게 만듭니다.
- 문제풀이에서 맞냐 틀리냐만 물어보거나, 답을 요구하는 질문이다.
- 질문이 학습 상황의 맥락과 연결되지 않거나 단순 확인 요청에 그친다.
- 질문자가 스스로 이해도를 점검하거나 사고하지 않고, 아예 모르는 상태에서 단순히 답을 요구한다.
#예시
- 2번 같은 게 조금 어려워요.
- 잘 모르겠어요.
- 음… 첫 문장을 어떻게 (할지 모르겠어요).
- 그럼 물티슈할 때 티슈는 뭐예요?

## 출력 형식
{{
      "idx": INT,
      "answer": "선생님의 가상 답변"
      "result": "True of False",
      "reason": "판단 이유"
}}
'''
        self.prompt = self.prompt.replace("{subject}", subject)